{"format": "graph-model", "generatedBy": "2.9.1", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_5": {"name": "input_5:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "80"}]}}}, "outputs": {"dense_14": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "320"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/while/maximum_iterations", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5746"}, {"size": "100"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/embedding_4/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/ReverseV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "320"}]}}}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}, {"size": "320"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/ReverseV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/global_max_pooling1d_4/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/batch_normalization_4/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/batch_normalization_4/batchnorm/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_12/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}, {"size": "80"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_13/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}, {"size": "80"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_14/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "input_5", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "80"}]}}}}, {"name": "StatefulPartitionedCall/sequential_7/embedding_4/Cast", "op": "Cast", "input": ["input_5"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/embedding_4/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/sequential_7/embedding_4/Cast", "StatefulPartitionedCall/sequential_7/embedding_4/embedding_lookup/axis"], "attr": {"batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_7/embedding_4/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_7/embedding_4/embedding_lookup", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_7/embedding_4/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_7/embedding_4/embedding_lookup", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/Shape", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice/stack", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice/stack_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/transpose", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/Shape", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice/stack", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice/stack_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/transpose", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/ReverseV2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros/packed/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/Shape_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice_1/stack", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/Shape_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice_1/stack", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/ReverseV2", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros/packed", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros_1/packed", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice_1"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros/packed", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros_1/packed", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice_1"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/while/loop_counter", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/while/maximum_iterations", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/time", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/TensorArrayV2_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/zeros_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/strided_slice_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/TensorArrayUnstack/TensorListFromTensor", "unknown_0", "unknown_1", "unknown_2"], "attr": {"_lower_using_switch_merge": {"b": false}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "80"}]}, {"dim": [{"size": "-1"}, {"size": "80"}]}, {}, {}, {"dim": [{"size": "100"}, {"size": "320"}]}, {"dim": [{"size": "320"}]}, {"dim": [{"size": "80"}, {"size": "320"}]}]}}, "body": {"func": {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699"}}, "_num_original_outputs": {"i": "11"}, "_stateful_parallelism": {"b": false}, "parallel_iterations": {"i": "32"}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "cond": {"func": {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_cond_49189_frozen_10698"}}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/while", "op": "While", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/while/loop_counter", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/while/maximum_iterations", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/time", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/TensorArrayV2_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/zeros_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/strided_slice_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/TensorArrayUnstack/TensorListFromTensor", "unknown_3", "unknown_4", "unknown_5"], "attr": {"parallel_iterations": {"i": "32"}, "cond": {"func": {"name": "__inference_sequential_7_bidirectional_4_backward_lstm_4_while_cond_49416_frozen_10700"}}, "output_shapes": {"list": {"shape": [{}, {}, {}, {}, {"dim": [{"size": "-1"}, {"size": "80"}]}, {"dim": [{"size": "-1"}, {"size": "80"}]}, {}, {}, {"dim": [{"size": "100"}, {"size": "320"}]}, {"dim": [{"size": "320"}]}, {"dim": [{"size": "80"}, {"size": "320"}]}]}}, "_stateful_parallelism": {"b": false}, "_num_original_outputs": {"i": "11"}, "_read_only_resource_inputs": {"list": {"i": ["8", "9", "10"]}}, "T": {"list": {"type": ["DT_INT32", "DT_INT32", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_INT32", "DT_VARIANT", "DT_FLOAT", "DT_FLOAT", "DT_FLOAT"]}}, "body": {"func": {"name": "__inference_sequential_7_bidirectional_4_backward_lstm_4_while_body_49417_frozen_10697"}}, "_lower_using_switch_merge": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/while:3", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/while:3", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/backward_lstm_4/transpose_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/ReverseV2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_7/bidirectional_4/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/forward_lstm_4/transpose_1", "StatefulPartitionedCall/sequential_7/bidirectional_4/ReverseV2", "StatefulPartitionedCall/sequential_7/bidirectional_4/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_7/global_max_pooling1d_4/Max", "op": "Max", "input": ["StatefulPartitionedCall/sequential_7/bidirectional_4/concat", "StatefulPartitionedCall/sequential_7/global_max_pooling1d_4/Max/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/batch_normalization_4/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_7/global_max_pooling1d_4/Max", "StatefulPartitionedCall/sequential_7/batch_normalization_4/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/batch_normalization_4/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_7/batch_normalization_4/batchnorm/mul_1", "StatefulPartitionedCall/sequential_7/batch_normalization_4/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_12/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/batch_normalization_4/batchnorm/add_1", "StatefulPartitionedCall/sequential_7/dense_12/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_13/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_12/Relu", "StatefulPartitionedCall/sequential_7/dense_13/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_13/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_14/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_7/dense_13/Relu", "StatefulPartitionedCall/sequential_7/dense_14/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_7/dense_14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_7/dense_14/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_7/dense_14/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_7/dense_14/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {"function": [{"signature": {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699", "inputArg": [{"name": "sequential_7_bidirectional_4_forward_lstm_4_while_sequential_7_bidirectional_4_forward_lstm_4_while_loop_counter", "type": "DT_INT32"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_sequential_7_bidirectional_4_forward_lstm_4_while_maximum_iterations", "type": "DT_INT32"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_placeholder", "type": "DT_INT32"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_placeholder_1", "type": "DT_VARIANT"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_placeholder_2", "type": "DT_FLOAT"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_placeholder_3", "type": "DT_FLOAT"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_sequential_7_bidirectional_4_forward_lstm_4_strided_slice_1_0", "type": "DT_INT32"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_tensorarrayv2read_tensorlistgetitem_sequential_7_bidirectional_4_forward_lstm_4_tensorarrayunstack_tensorlistfromtensor_0", "type": "DT_VARIANT"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_lstm_cell_13_split_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_lstm_cell_13_split_1_readvariableop_resource_0", "type": "DT_FLOAT"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_lstm_cell_13_readvariableop_resource_0", "type": "DT_FLOAT"}], "outputArg": [{"name": "sequential_7_bidirectional_4_forward_lstm_4_while_identity", "type": "DT_INT32"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_identity_1", "type": "DT_INT32"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_identity_2", "type": "DT_INT32"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_identity_3", "type": "DT_VARIANT"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_identity_4", "type": "DT_FLOAT"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_identity_5", "type": "DT_FLOAT"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_sequential_7_bidirectional_4_forward_lstm_4_strided_slice_1", "type": "DT_INT32"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_tensorarrayv2read_tensorlistgetitem_sequential_7_bidirectional_4_forward_lstm_4_tensorarrayunstack_tensorlistfromtensor", "type": "DT_VARIANT"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_lstm_cell_13_split_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_lstm_cell_13_split_1_readvariableop_resource", "type": "DT_FLOAT"}, {"name": "sequential_7_bidirectional_4_forward_lstm_4_while_lstm_cell_13_readvariableop_resource", "type": "DT_FLOAT"}], "isStateful": true, "controlOutput": ["sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp", "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp_1", "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp_2", "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp_3", "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split/ReadVariableOp", "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split_1/ReadVariableOp"]}, "nodeDef": [{"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split_1/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ones_like/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/add_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ones_like/Shape", "op": "Shape", "input": ["sequential_7_bidirectional_4_forward_lstm_4_while_placeholder_2"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split/ReadVariableOp", "op": "Identity", "input": ["sequential_7_bidirectional_4_forward_lstm_4_while_lstm_cell_13_split_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split_1/ReadVariableOp", "op": "Identity", "input": ["sequential_7_bidirectional_4_forward_lstm_4_while_lstm_cell_13_split_1_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp", "op": "Identity", "input": ["sequential_7_bidirectional_4_forward_lstm_4_while_lstm_cell_13_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp_1", "op": "Identity", "input": ["sequential_7_bidirectional_4_forward_lstm_4_while_lstm_cell_13_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp_2", "op": "Identity", "input": ["sequential_7_bidirectional_4_forward_lstm_4_while_lstm_cell_13_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp_3", "op": "Identity", "input": ["sequential_7_bidirectional_4_forward_lstm_4_while_lstm_cell_13_readvariableop_resource_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/add", "op": "AddV2", "input": ["sequential_7_bidirectional_4_forward_lstm_4_while_placeholder", "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/add/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["sequential_7_bidirectional_4_forward_lstm_4_while_tensorarrayv2read_tensorlistgetitem_sequential_7_bidirectional_4_forward_lstm_4_tensorarrayunstack_tensorlistfromtensor_0", "sequential_7_bidirectional_4_forward_lstm_4_while_placeholder", "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/TensorArrayV2Read/TensorListGetItem/element_shape:output:0"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/add_1", "op": "AddV2", "input": ["sequential_7_bidirectional_4_forward_lstm_4_while_sequential_7_bidirectional_4_forward_lstm_4_while_loop_counter", "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/add_1/y:output:0"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ones_like", "op": "Fill", "input": ["sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ones_like/Shape:output:0", "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ones_like/Const:output:0"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split", "op": "Split", "input": ["__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split/split_dim:output:0", "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split/ReadVariableOp:output:0"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "4"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split_1", "op": "Split", "input": ["__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split_1/split_dim:output:0", "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split_1/ReadVariableOp:output:0"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice", "op": "StridedSlice", "input": ["sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp:output:0", "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice/stack:output:0", "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice/stack_1:output:0", "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice/stack_2:output:0"], "attr": {"begin_mask": {"i": "3"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_1", "op": "StridedSlice", "input": ["sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp_1:output:0", "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_1/stack:output:0", "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_1/stack_1:output:0", "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_1/stack_2:output:0"], "attr": {"Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_2", "op": "StridedSlice", "input": ["sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp_2:output:0", "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_2/stack:output:0", "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_2/stack_1:output:0", "__inference_sequential_7_bidirectional_4_forward_lstm_4_while_body_49190_frozen_10699/sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_2/stack_2:output:0"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/NoOp", "op": "NoOp", "input": ["^sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp", "^sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp_1", "^sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp_2", "^sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/ReadVariableOp_3", "^sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split/ReadVariableOp", "^sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/split_1/ReadVariableOp"], "attr": {"_acd_function_control_output": {"b": true}}}, {"name": "sequential_7/bidirectional_4/forward_lstm_4/while/lstm_cell_13/strided_slice_3", "op": "StridedSlice", "input": 